Test-results
From DB

siege -c10 -t20S http://localhost:8080/users

Transactions:		        1351 hits
Availability:		      100.00 %
Elapsed time:		       19.20 secs
Data transferred:	      725.87 MB
Response time:		        0.14 secs
Transaction rate:	       70.36 trans/sec
Throughput:		       37.81 MB/sec
Concurrency:		        9.96
Successful transactions:        1351
Failed transactions:	           0
Longest transaction:	        0.73
Shortest transaction:	        0.10


siege -c25 -t20S http://localhost:8080/users

Transactions:		        1480 hits
Availability:		      100.00 %
Elapsed time:		       19.54 secs
Data transferred:	      795.18 MB
Response time:		        0.33 secs
Transaction rate:	       75.74 trans/sec
Throughput:		       40.70 MB/sec
Concurrency:		       24.79
Successful transactions:        1480
Failed transactions:	           0
Longest transaction:	        0.69
Shortest transaction:	        0.12

siege -c50 -t20S http://localhost:8080/users

Transactions:		        1608 hits
Availability:		      100.00 %
Elapsed time:		       19.35 secs
Data transferred:	      863.96 MB
Response time:		        0.59 secs
Transaction rate:	       83.10 trans/sec
Throughput:		       44.65 MB/sec
Concurrency:		       49.20
Successful transactions:        1608
Failed transactions:	           0
Longest transaction:	        1.08
Shortest transaction:	        0.10

siege -c100 -t20S http://localhost:8080/users

Transactions:		        1536 hits
Availability:		      100.00 %
Elapsed time:		       19.51 secs
Data transferred:	      825.27 MB
Response time:		        1.23 secs
Transaction rate:	       78.73 trans/sec
Throughput:		       42.30 MB/sec
Concurrency:		       96.69
Successful transactions:        1536
Failed transactions:	           0
Longest transaction:	        2.26
Shortest transaction:	        0.10



siege -c100 -t20S http://localhost:8080/users (in memory cache)
Transactions:		        3000 hits
Availability:		      100.00 %
Elapsed time:		       19.53 secs
Data transferred:	     1611.86 MB
Response time:		        0.62 secs
Transaction rate:	      153.61 trans/sec
Throughput:		       82.53 MB/sec
Concurrency:		       95.21
Successful transactions:        3000
Failed transactions:	           0
Longest transaction:	        1.73
Shortest transaction:	        0.01

---------------------------------------------------------------------------------
Rewrite

siege -10 -t35s http://localhost:8080/users

Transactions:                   7845 hits
Availability:                 100.00 %
Elapsed time:                  34.89 secs
Data transferred:            4215.55 MB
Response time:                  0.11 secs
Transaction rate:             224.85 trans/sec
Throughput:                   120.82 MB/sec
Concurrency:                   24.69
Successful transactions:        7846
Failed transactions:               0
Longest transaction:            1.02
Shortest transaction:           0.00


siege -25 -t35s http://localhost:8080/users

Transactions:                   6433 hits
Availability:                 100.00 %
Elapsed time:                  34.90 secs
Data transferred:            3456.37 MB
Response time:                  0.13 secs
Transaction rate:             184.33 trans/sec
Throughput:                    99.04 MB/sec
Concurrency:                   24.75
Successful transactions:        6433
Failed transactions:               0
Longest transaction:            0.46
Shortest transaction:           0.02


siege -50 -t35s http://localhost:8080/users

Transactions:                   6327 hits
Availability:                 100.00 %
Elapsed time:                  34.69 secs
Data transferred:            3399.95 MB
Response time:                  0.14 secs
Transaction rate:             182.39 trans/sec
Throughput:                    98.01 MB/sec
Concurrency:                   24.76
Successful transactions:        6328
Failed transactions:               0
Longest transaction:            0.48
Shortest transaction:           0.01


siege -100 -t35s http://localhost:8080/users

Transactions:                   6956 hits
Availability:                 100.00 %
Elapsed time:                  34.23 secs
Data transferred:            3737.37 MB
Response time:                  0.12 secs
Transaction rate:             203.21 trans/sec
Throughput:                   109.18 MB/sec
Concurrency:                   24.72
Successful transactions:        6956
Failed transactions:               0
Longest transaction:            0.44
Shortest transaction:           0.01


---------------------------------------------------------------------------------
Block

siege -10 -t35s http://localhost:8080/users

Transactions:		        6190 hits
Availability:		      100.00 %
Elapsed time:		       34.87 secs
Data transferred:	     3325.80 MB
Response time:		        0.14 secs
Transaction rate:	      177.52 trans/sec
Throughput:		       95.38 MB/sec
Concurrency:		       24.74
Successful transactions:        6190
Failed transactions:	           0
Longest transaction:	        1.34
Shortest transaction:	        0.00


siege -25 -t35s http://localhost:8080/users

Transactions:		        5319 hits
Availability:		      100.00 %
Elapsed time:		       34.68 secs
Data transferred:	     2857.83 MB
Response time:		        0.16 secs
Transaction rate:	      153.37 trans/sec
Throughput:		       82.41 MB/sec
Concurrency:		       24.66
Successful transactions:        5319
Failed transactions:	           0
Longest transaction:	        0.71
Shortest transaction:	        0.00

siege -50 -t35s http://localhost:8080/users

Transactions:		        5718 hits
Availability:		      100.00 %
Elapsed time:		       34.18 secs
Data transferred:	     3072.21 MB
Response time:		        0.15 secs
Transaction rate:	      167.29 trans/sec
Throughput:		       89.88 MB/sec
Concurrency:		       24.72
Successful transactions:        5718
Failed transactions:	           0
Longest transaction:	        0.61
Shortest transaction:	        0.00


siege -100 -t35s http://localhost:8080/users

Transactions:		        6006 hits
Availability:		      100.00 %
Elapsed time:		       34.49 secs
Data transferred:	     3226.94 MB
Response time:		        0.14 secs
Transaction rate:	      174.14 trans/sec
Throughput:		       93.56 MB/sec
Concurrency:		       24.76
Successful transactions:        6006
Failed transactions:	           0
Longest transaction:	        0.57
Shortest transaction:	        0.00